Table of Contents
 Class MatPrestressSteel
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material prestressing steel base class
public abstract class MatPrestressSteel : Material
Inheritance
object
OpenObject
OpenElementId
Material
MatPrestressSteel
Derived
MatPrestressSteelEc2
MatPrestressSteelSIA
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Area
Area
public double Area { get; set; }
Property Value
double
 Diameter
Diameter
public double Diameter { get; set; }
Property Value
double
 EquivalentDiameter
Equivalent diameter
public double EquivalentDiameter { get; set; }
Property Value
double
 NumberOfWires
number of wires in strand
public int NumberOfWires { get; set; }
Property Value
int
 Edit this page